// OOLw1d3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;
class Fraction {
private:
    int a;
    int b;
public:
    int GetA() {
        return a;
    }
    int GetB() {
        return b;
    }
    void Enter(int _a, int _b) {
        a = _a;
        b = _b;
    }
    Fraction Summ(Fraction d) {
        Fraction c;
        c.Enter(d.GetA() * b + a * d.GetB(), b * d.GetB());
        return c;
    }
    Fraction Minus(Fraction d) {
        Fraction c;
        c.Enter(d.GetA() * b - a * d.GetB(), b * d.GetB());
        return c;
    }
    Fraction Mult(Fraction d) {
        Fraction c;
        c.Enter(d.GetA() * a, d.GetB()*b);
        return c;
    }
};
int main()
{
    cout << "Hello World!\n";
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
